#lang at-exp racket/base

(require racket/format
         racket/dict
         racket/list
         (file "houying.rkt"))

(provide 小寒 大寒 立春 雨水 惊蛰 春分 清明 谷雨 立夏 小满 芒种 夏至 小暑 大暑 立秋 处暑 白露 秋分 寒露 霜降 立冬 小雪 大雪 冬至
         节气-名字 节气-释义 节气-排位 节气-气候 节气-饮食 节气-农事 节气-植物 节气-习俗
         二十四节气
         上一节气
         下一节气
         节气->候应
         节气->初候
         节气->二候
         节气->三候
         候应->节气)

(define (下一节气 此节气)
  (define 彼排位
    (if (= 24 (节气-排位 此节气))
        1
        (add1 (节气-排位 此节气))))
  (findf (lambda (其)
           (= 彼排位 (节气-排位 其)))
         二十四节气))

(define (上一节气 此节气)
  (define 彼排位
    (if (= 1 (节气-排位 此节气))
        24
        (sub1 (节气-排位 此节气))))
  (findf (lambda (其)
           (= 彼排位 (节气-排位 其)))
         二十四节气))

(define (节气->候应 此节气)
  (define i (* (节气-排位 此节气) 3))
  (define 其候 (take-right (take 七十二候应 i) 3))
  其候)

(define (节气->初候 此节气)
  (first (节气->候应 此节气)))

(define (节气->二候 此节气)
  (second (节气->候应 此节气)))

(define (节气->三候 此节气)
  (third (节气->候应 此节气)))

(define (候应->节气 此候应)
  (list-ref 二十四节气 (quotient (sub1 (候应-排位 此候应)) 3)))


(struct 节气 (名字 释义 排位
              气候  饮食 农事 植物
              习俗)
  #:methods gen:custom-write
  [(define (write-proc 此节气 port mode)
     (display @~a{#<节气-@(节气-名字 此节气)(#@(节气-排位 此节气))(@(候应-名字 (节气->初候 此节气)) @(候应-名字 (节气->二候 此节气)) @(候应-名字 (节气->三候 此节气)))>}
              port))])

(define 立春
  (节气 '立春 "立春，是二十四节气中的第一个节气，太阳到达黄经315°，在公历每年2月3日至5日之间。立春意味着春天开始，从立春至立夏为农历意义上的春季，生肖也以立春作为起始点。" 1
        "气温回升，乍暖还寒"
        "萝卜、丝瓜、桂圆"
        "灌溉追肥，防冻保温"
        "迎春、樱桃、望春"
        (hash "预测收成" "「立春天气晴，百物好收成」，习俗认为立春日的天气好坏能预测全年的农作收成状况。如果立春是晴天，这一年五谷就会丰收。"
              "鞭春牛" "鞭春牛为中国吴越地区的传统习俗，盛行于唐宋两代。人们在立春或春节时用泥土制作耕牛雕像，通过鞭打耕牛雕像象征春耕开始，策励农耕、祈求丰收。"
              "咬春" "立春之日，中国民间讲究食用时令蔬菜，既可防病，又有迎春之意。通常人们会在立春当天食萝卜，因萝卜味辣，故取「咬得草根断，则百事可做」之意。除此以外人们还可食用春饼或春卷。"
              "躲春" "躲春，就是躲开立春的这一天，每到立春这一天不能有口舌之争，必须和和睦睦、心平气和地迎接这一天。")))

(define 雨水
  (节气 '雨水 "雨水，是二十四节气中的第二个节气，太阳到达黄经330°，在公历每年2月18日至20日之间。雨水节气意味着气温回升、冰雪融化、降水增多，故取名为雨水。" 2
        "气温回升，降水增多"
        "小米、荠菜、豆苗"
        "培土施肥，清沟排水"
        "杏花、李花"
        (hash "送雨水" "在中国四川地区，雨水节气时女婿有为岳父母「送节」的习俗，以表达岳父母养育女儿的感恩之情。"
              "拉保保" "「拉保保」是四川地区在雨水节气的一项习俗，「保保」意为「干爹」，「拉保保」即「拜干爹」。古代人们大多会为孩子求神问卦，相信需要根据孩子的命格认一个合适的干爹，才能保证孩子长命百岁。"
              "撞拜寄" "「撞拜寄」与「拉保保」习俗类似，为川西地区的地方习俗。雨水时节的清晨，当地女子带着自己的孩子，在路边拦下第一个经过自己面前的路人，让孩子向那人磕头拜寄，向对方做干儿子或干女儿。这项习俗的目的是为保佑孩子健康成长。")))

(define 惊蛰
  (节气 '惊蛰 "惊蛰，是二十四节气中的第三个节气，太阳到达黄经345°之时，在公历每年3月5日至6日。惊蛰原名「启蛰」，汉代为避汉景帝刘启之讳而改为「惊」字。 惊蛰节气意味着进入春季，气温逐渐回升，蛰伏冬眠的昆虫被春雷惊醒，纷纷爬出洞穴活动，春耕季由此开始，大地重新焕发出勃勃生机。 《夏小正》曰：正月启蛰，言发蛰也。万物出乎震，震为雷，故曰惊蛰。是蛰虫惊而出走矣。" 3
        "气温回暖，春雷始鸣"
        "梨子"
        "春耕开始、防病虫害"
        "桃花"
        (hash "祭白虎"
              "民间传说认为，每到惊蛰之日白虎就会出来觅食，因此在这一天以白纸绘制老虎，用猪血、猪油、鸡蛋等进行祭拜、喂食，让白虎吃饱后便不会再伤人。"
              "打小人"
              "《千金月令》曰：「惊蛰日，取石灰糁门限外，可绝虫蚁。」惊蛰时万物复苏，人们用艾草熏蒸、洒石灰等手段驱除蚊虫，后来逐渐演变成「打小人」，通过拍打纸质人偶的方式，象征驱赶霉运和讨厌的事物，祈求顺心如意。"
              "惊蛰吃梨"
              "惊蛰时节，乍暖还寒，除了注意防寒保暖，还因气候比较干燥，容易使人口干舌燥、外感咳嗽，所以民间素有惊蛰吃梨的习俗。")))

(define 春分
  (节气 '春分 "春分，是二十四节气中的第四个节气，太阳到达黄经0°也就是春分点之时，在公历每年3月21日前后。「春分者，阴阳相半也，故昼夜均而寒暑平。」春分时太阳直射赤道，全球昼夜等长，无极昼极夜现象，因此又称为「日夜分」。 春分过后，位于北半球的中国地区夜渐短、昼渐长。" 4
        "阴晴不定，昼夜等长" "春菜、萝卜、汤圆" "防范旱情「倒春寒」冻害" "柳树、杏花、樱花"
        (hash "吃春菜" "「春菜」是一种野苋菜，又名「春碧蒿」。春分日，人们到山林中采摘这种野菜，清洗后同鲜鱼一起做成「春汤」，民间认为吃了之后可保一年身体健康。「试寻野菜炊春饭，便是江南二月天。」"
              "放风筝" "风筝古称「纸鸢」，历史可以追溯至春秋战国时期，最初主要用于军事，唐朝之后成为一种流行的娱乐活动。严冬过后，晴朗的春日正是放风筝的好时节，人们在风筝上书写祝福语，祈求新一年健康幸福；或是在放风筝时将线剪断，飞走的风筝象征着疾病、霉运被风带走。"
              )))

(define 清明
  (节气 '清明 "清明，三月节。按《国语》曰：时有八风。历独指清明风为三月节，此风属巽故也。万物齐乎巽，物至此时皆以洁齐而清明矣。清明是二十四节气中的第六个节气，太阳到达黄经15°之时，在公历每年4月5日左右。「万物生长此时，皆清洁而明净，故谓之清明。」到了清明，春季接近结束，万物茁壮生长，既是春耕的关键时期，也是出游踏青的好时节。「清明时节雨纷纷，路上行人欲断魂。借问酒家何处有？牧童遥指杏花村。」——杜牧" 5
        "细雨绵绵"
        "青团"
        "播种春小麦等"
        "白桐、樱花、油菜花"
        (hash "扫墓祭祖" "扫墓的习俗原本来自「寒食节」，至唐代已与清明并称，人们会前往祖先的墓地或祠堂进行祭拜，整修坟墓、供奉祭品，既表达对先人的缅怀之情，也为家族提供团聚的机会。部分地区还保留了「寒食」的习惯，这一天不生火做饭，只吃预先准备好的熟食和冷食。"
              "出游踏青" "踏青的习俗来自「上巳节」，历史可以追溯至西周时期，《论语》所谓「浴乎沂，风乎舞雩，咏而归」。上巳节原为每年三月初三，至宋代与清明融合。这一天人们外出游玩观赏春色，年轻人们放风筝、荡秋千、采花插柳、斗鸡拔河，一派生机勃勃的春日胜景。"
              "青团" "青团是江南地区的清明时令点心。其主体由糯米粉制成，经青艾（草头汁）调和而呈绿色糕团，一般为豆沙馅或芝麻馅。食用时保留了寒食的习惯。对江浙沪而言，青团是清明祭祖时必不可少的供品。")))

(define 谷雨
  (节气 '谷雨 "谷雨，三月中，自雨水后，土膏脉动，今又雨其谷于水也。雨读作去声，如雨我公田之雨。盖谷以此时播种，自上而下也。谷雨是二十四节气中的第六个节气，也是春季的最后一个节气，太阳到达黄经30°之时，在公历每年4月19至21日。「清明断雪，谷雨断霜」，谷雨的到来意味着寒冷天气结束，每年的第一场大雨通常出现于这一时期，也正对应着春耕播种期，古人因此称之为「雨生百谷」，寓意春雨从天上向地里播种谷物。 「蚕房已裹清明种，茶户初收谷雨芽。」——陆游《暮春龟堂即事》" 6
        "寒潮结束，降水增加"
        "谷雨茶、香椿"
        "插秧播种，防治虫害"
        "牡丹花"
        (hash "饮谷雨茶"
              "谷雨茶又名「春前茶」，专门在谷雨这一天采制。暮春时节新茶色泽嫩绿，叶质柔软，早在北宋时期就已流行于民间，有「玉髓新烹谷雨茶」之称。"
              "食香椿"
              "北方谷雨食香椿习俗，谷雨前后是香椿上市的时节，这时的香椿醇香爽口营养价值高，有「雨前香椿嫩如丝」之说。"
              "赏牡丹花"
              "谷雨前后也是牡丹花开的重要时段，因此，牡丹花也被称为谷雨花、富贵花，。「谷雨三朝看牡丹」，雨时节赏牡丹已绵廷千年。"
              "谷雨祭海"
              "谷雨时节正是春海水暖之时，百鱼行至浅海地带，是下海捕鱼的好日子。俗话说「骑着谷雨上网场」。为了能够出海平安、满载而归，谷雨这天渔民要举行海祭，祈祷海神保佑。")))

(define 立夏
  (节气 '立夏 "立夏，是二十四节气中的第七个节气，即太阳到达黄经45°之时，在公历每年5月5日至7日之间，标志着夏天的到来。立夏是告别春天、迎来夏日的转折点，与立春、立秋、立冬一样，也是标志四季开始的日子，从这一天到立秋前的日子都被称作夏季。" 7
        "炎暑将临，雷雨增多"
        "蚕豆、煮蛋"
        "及时收割成熟的春花作物"
        "芍药、栀子花"
        (hash "挂蛋" "谚语云：「立夏胸挂蛋，孩子不疰夏。」这一习俗起源于古代瘟神的传说，现在人们会将煮好的鸡蛋套上彩线编织成的丝网袋，挂在孩子颈上以祈求健康，与之相关的习俗还有「拄蛋」、「吃立夏蛋」等。"
              "秤人" "悬秤称人的习俗流行于旧时江南一带。清人秦荣光在《上海县竹枝词》中写道：「立夏称人轻重数，秤悬梁上笑喧闺。」立夏时节，年长者悬大秤于房梁或院前树叉上，男女老幼依次上秤称重，妇女互相品肥论瘦，嘻哈打趣。" )))

(define 小满
  (节气 '小满 "小满，是二十四节气中的第八个节气，即太阳到达黄经60°之时，在公历每年5月20日至22日之间。「小满」的含义是夏熟作物籽粒逐渐灌浆饱满，但还未成熟。在南方地区，小满是适宜水稻栽插的时节，因而「满」被赋予新的寓意，用来形容雨水的盈缺。" 8
        "南北温差缩小、降水增多"
        "苦菜"
        "防治虫害、预防暴雨"
        "绣球花、金丝桃"
        (hash "祭车神"
              "农村地区有「祭三车」的习俗，即水车、牛车和丝车。小满时节，农家在水车的车基上放置鱼肉、香烛等物品祭拜，祭品中还有一杯白水，祭拜时将白水泼入田中，代表水源涌旺之意。"
              "祭蚕"
              "中国南方农村盛行养蚕，尤其是江浙一带。古时相传小满为蚕神诞辰，养蚕人家于每年农历四月举行祈蚕节，用水果、美酒和菜肴祭拜蚕娘和蚕神，将面粉制成的「面茧」放在稻草山上，象征蚕茧丰收。")))

(define 芒种
  (节气 '芒种 "芒种，是二十四节气中的第九个节气，即太阳到达黄经75°之时，在公历每年6月5日至7日之间。「芒种」意指稻子榖粒上长出了细芒。芒种是农作物种植时间的分界点，象征着大麦、小麦等有芒作物的收获，以及谷、黍类作物的播种。" 9
        "雨量充沛、气温升高"
        "青梅、薏米"
        "及时收获播种"
        "植物木槿花、合欢花"
        (hash "送花神"
              "农历五月，百花渐凋残、零落，民间于芒种之日举行祭祀花神仪式，饯送花神归位，以表达对花神的感激之情，盼望来年再次相会。"
              "安苗"
              "安苗习俗始于明初，存于皖南地区。家家户户用新麦面蒸发包，将面捏成五谷六畜、瓜果蔬菜等形状，然后用蔬菜汁染上颜色，作为祭祀供品，祈求五谷丰登。"
              "打泥巴仗"
              "贵州省黔东南苗族侗族自治州黎平县的侗族则在芒种日有打泥巴仗的习俗，当日新婚夫妇一同至田间插秧，并在插完秧苗后抓起田里的泥巴互相投掷。")))

(define 夏至
  (节气 '夏至 "夏至，是二十四节气中的第十个节气，即太阳到达黄经90°之时，公历每年6月20日至22日之间，标志着北半球各地的白昼时间达到全年最长。夏至是最早被确定的一个节气，这一天太阳几乎直射北回归线。从这一天开始，北半球白昼逐渐减短，日出、日落的方位也开始往南移动。" 10
        "暴雨、梅雨天气、高温潮湿"
        "面条、麦粽、夏至饼"
        "蓄伏前雨水"
        "花菖蒲、梧桐"
        (hash "祭神祀祖"
              "夏至时值麦收，自古以来有庆祝丰收、祭祀祖先之俗。最晚自汉代起，夏至作为节日被纳入古代祭神礼典，《史记·封禅书》记载：「夏至日，祭地，皆用乐舞。」这个习俗在浙江金华地区仍有遗存。"
              "吃面"
              "中国各地夏至食俗虽有差异，却有吃面的共同点。北方地区有「冬至饺子夏至面」的俗语，因夏至收获新麦，食面也有尝新的意思。")))

(define 小暑
  (节气 '小暑 "小暑，是二十四节气中的第十一个节气，即太阳到达黄经105°之时，在公历每年7月6日至8日之间，表示着季夏时节的正式开始。暑，意为炎热，小暑则意味着从这一天开始气温升高，天气逐渐炎热。小暑的标志是「出梅」和「入伏」，即梅雨季结束，进入伏旱期。" 11
        "气温升高、旱南涝北、多雷暴天气"
        "西瓜、莲藕、莲子、绿豆、百合等"
        "培土追肥，防治病虫"
        "无"
        (hash "吃伏面"
              "北方地区在小暑时节吃饺子或面条，有「头伏饺子二伏面，三伏烙饼摊鸡蛋」的习俗。小暑入伏，小麦收割不足一个月，粮仓富足，而人们也因为高温气候而食欲不佳。饺子是传统食品中开胃解馋之选，所以人们在小暑时节用新磨的面粉包饺子，用新白面做面条。除此之外，根据不同地区的风俗习惯，小暑还可吃生黄瓜、鸡蛋、过水面和炒面。"
              "食新"
              "人们在小暑之日用新米做饭，供祀五谷大神和祖先，祈求秋后五谷丰登，且家家都要尝新米和尝新酒。有些地区则是将新收割的小麦炒熟磨成面粉，加水加糖搅拌均匀制成「炒面」食用，具有「解烦热，止泻，实大肠」的功效。"
              "天贶节"
              "农历六月初六为中国传统节日天贶节。此节起源于宋代，有「六月六晒红绿」的说法。六月六为梅雨季之后，人们进行晒衣晒经书，以防止霉烂；且农历六月为农闲时期，故妇女回娘家、祭祖求子也是天贶节的重要活动。")))

(define 大暑
  (节气 '大暑 "大暑，是二十四节气中的第十二个节气，即太阳到达黄经120°之时，在公历每年7月22日至24日之间。大暑正值「三伏」天中的「中伏」，是中国大部分地区一年中最热的时期，也是喜热作物生长速度最快的时期。" 12
        "高温少雨，多旱涝灾害"
        "绿豆、冬瓜、苦瓜、生姜等"
        "抢收抢种、防旱排涝"
        "茉莉、荷花"
        (hash "赏荷采莲"
              "大暑为荷花盛开时期，大暑所在的六月也称「荷月」，此时各地都有赏荷采莲的习俗。江苏常熟、通州、吴县等地，以及北京什刹海为著名的观荷之处，人们观荷纳凉，景象十分壮观。赏莲之余，长者往往会教育孩子学习莲「出淤泥而不染」的品格，为「学莲」。农历六月二十四日为「观莲节」，相传为荷花生日，节日中女子采集莲花或莲子赠予男子，如同以莲子相赠，表达绵绵情谊。"
              "送大暑船"
              "浙江台州沿海地区在大暑时节有「送大暑船」的习俗，至今已有百年历史。古时大暑时节疫病流行最为严重，为祈求祛病消灾，人们建五圣庙进行祭祀并制作「大暑船」，船内设有神完、香案，摆放鸡鱼等牺牲。人们趁落潮时将「大暑船」推入海中，以求带走疾病不祥。如今当地居民在大暑时将一艘精美的纸制「大暑船」送入海中，并由渔轮一路护送至出海口，然后当场将大暑船焚烧掉，代表「送暑」和「平安」。")))

(define 立秋
  (节气 '立秋 "立秋，是二十四节气中的第十三个节气，即太阳到达黄经135°之时，在公历每年8月7日至9日之间，代表夏季结束、秋季开始。古人认为立秋为夏秋之交的时刻，将进行秋收、迎秋祭祀等活动，具有重要的意义。" 13
        "「秋老虎」、气温降低"
        "苹果、山楂、梨、西瓜、四季豆等"
        "追肥耘田、整枝去草"
        "菊花"
        (hash "贴秋膘"
              "为弥补夏季长期食清淡食物而造成的营养损失，人们在立秋时会多吃肉类，如炖肉、烤肉、红烧肉等，「以肉贴膘」。"
              "啃秋"
              "立秋时全家一起食用西瓜，防止疟疾、腹泻之症，也有迎秋之意，则为「啃秋」。个别地区则是吃饺子，又称「咬秋」。"
              "戴楸叶"
              "立秋「戴楸叶」习俗起源于宋朝。立秋时，妇女儿童将楸叶裁剪成各式花样，佩戴在鬓角或胸前，以保佑一秋平安。现今部分农村男女还会将楸叶编成帽子戴在头上，或采集楸叶熬膏使用。")))

(define 处暑
  (节气 '处暑 "处暑，是二十四节气中的第十四个节气，即太阳到达黄经150°之时，在公历每年8月22日至24日之间，意味着即将进入气象意义的秋季。「处」为「终止」，处暑即「出暑」，为气温由炎热向寒冷过渡，也是粮食成熟的时节。 三伏天气已结束或接近尾声，所以称「暑气至此而止矣」。亦有「处暑寒来」的谚语，说明夏天的暑气逐渐消退。中国长江以北地区气温开始逐渐下降。虽然秋季在意义上已经来临，但夏天的暑气仍然未减。这种忽然变热的天气，也被称作秋老虎。" 14
        "「秋老虎」、昼夜温差加大，降雨减少"
        "鸭子、萝卜、鱼等"
        "收割晒粮"
        "桂花"
        (hash "吃鸭子"
              "北京有处暑吃鸭子的传统。做法也五花八门，如白切鸭、烤鸭等。"
              "中元节"
              "农历七月十五为中元节，佛教称盂兰盆节，民间俗称鬼节、七月半。中元节是东亚文化中的一个重要传统节日，和除夕、清明、重阳并称中华传统节日中四大祭祖节日。最初为农民在夏末秋初祭祀田神、感谢大地的节日，后逐渐演变为祭祀一切亡灵的节日。在中元节，人们举行普度布施活动，邀请僧人、道士诵经超度亡魂。人们还会在河中投放河灯，以普度水中的落水鬼和孤魂野鬼。")))

(define 白露
  (节气 '白露 "白露是二十四节气中的第十五个节气，太阳到达黄经165°之时，在公历每年9月7日至9日之间。入秋天气转凉，昼夜温差变大，清晨可以在草木上看见凝结的露珠，「秋属金，金色白，阴气渐重，露凝而白也」，因此称为「白露」。 俗语云：“处暑十八盆，白露勿露身。”这两句话的意思是说，处暑仍热，每天须用一盆水洗澡，过了十八天，到了白露，就不要赤膊裸体了，以免着凉。 「蒹葭苍苍，白露为霜，所谓伊人，在水一方」——《诗经》" 15
        "气温降低，晨露凝结"
        "梨、龙眼、白露茶、米酒、红薯"
        "灌水保温"
        "桂花"
        (hash "祭禹王"
              "传说大禹治水「于吴，则通渠三江、五湖」就是指太湖，因此太湖一带的渔民称他为「水路菩萨」，每年清明、白露举办祭典仪式，祈求大禹保佑平安与丰收。"
              "吃龙眼"
              "福建福州的习俗是在白露这一天吃龙眼。龙眼，成熟期在农历八月，由于古时称八月为「桂月」，加上龙眼果实为原型，所以又称「桂圆」。"
              "白露茶"
              "茶树经过夏季的酷热，白露前后是茶叶生长的好时期，比春茶更经泡，茶味甘醇。白露茶是白露时采摘的茶，真正喝到白露茶的时候已过了白露节气。")))

(define 秋分
  (节气 '秋分 "秋分是二十四节气中的第十六个节气，太阳到达黄经180°之时，在公历每年9月23日前后。「秋分者，阴阳相半也，故昼夜均而寒暑平。」 秋分时，全球昼夜等长。秋分之后，北半球各地昼渐短夜渐长，南半球各地昼渐长夜渐短。同时这一天也是秋季90天的中分点，因此名为「秋分」。 「白露早，寒露迟，秋分种麦正当时。」秋分是我国华北地区冬小麦的播种时间，也是南部地区晚稻、棉花等作物的收获时节。 「今年秋气早，木落不待黄，蟋蟀当在宇，遽已近我床」——陆游《秋分后顿凄冷有感》" 16
        "气温持续降低，温差明显增大"
        "月饼、秋菜、新米、梨、柿、杨桃、柚子"
        "收晚稻、种冬麦"
        "桂花"
        (hash "中秋节"
              "中秋，最早出现于《周礼》，《礼记·月令》「仲秋之月养衰老，行糜粥饮食。」"
              "祭月"
              "《礼记》曰：「天子春朝日，秋夕月。朝日之朝，夕月之夕。」从周天子时就有「秋分祭月」的传统，后来这一活动逐渐传播到民间，演变成现代的中秋节。"
              "粘雀子嘴"
              "将煮熟的汤圆用竹签穿好，插在田边，「粘雀子嘴」，寓意麻雀吃了汤圆嘴就会被粘住，不再偷吃庄稼。"
              "吃秋菜"
              "「秋菜」是一种野苋菜，俗名「秋碧蒿」。每逢秋分，岭南地区的人们流行在田野中采摘秋菜，与鱼片一同烹煮，名曰「秋汤」。俗语道：「秋汤灌脏，洗涤肝肠。阖家老少，平安健康。」")))

(define 寒露
  (节气 '寒露 "寒露，是二十四节气中的第十七个节气，太阳到达黄经195°之时，在公历每年10月7日至8日期间。「露气寒冷，将凝结也。」寒露标志着深秋到来，气温降低接近零度，露水快要凝结成冰，故谓之「寒」。 白露、寒露、霜降三个节气，依次表示气候从凉爽到寒冷的变化。中国地域辽阔，南北方气温差异较大，但各地均应注意防寒保暖。" 17
        "秋风凛冽，初见霜雪"
        "螃蟹、山药、梨子、柿、柑橘"
        "预防冻害"
        "菊花、枫树"
        (hash "登高"
              "「停车坐爱枫林晚，霜叶红于二月花。」寒露正值重阳节前后，人们有登高望远的习俗，在山林中欣赏红叶、菊花，吃螃蟹，饮菊花酒。"
              "吃花糕"
              "除登高之外，因「高」与「糕」谐音，故有吃重阳花糕的习俗，寓意「步步高升」。传统花糕种类主要有糙花糕、细花糕、金钱花糕等，夹制各种蜜饯、干果。")))

(define 霜降
  (节气 '霜降 "霜降，是二十四节气中的第十八个节气，也是秋季的最后一个节气，在太阳到达黄经210°之时，公历每年10月23至24日。「九月中，气肃而凝，露结为霜矣。」霜降意味着秋天即将结束，气温跌至零度以下，气候学的「霜期」由此开始。 「霜降水返壑，风落木归山。」——白居易《岁晚》" 18
        "寒风凛冽，露结为霜"
        "柿子、羊肉"
        "预防霜冻"
        "木芙蓉"
        (hash "吃柿子"
              "柿子的成熟期恰好在霜降前后，人们认为吃柿子可以御寒，防止感冒。此外，利用霜降时的低温让柿子「上霜」，能制成更加美味可口的柿饼。"
              "补霜降"
              "霜降时节正值秋冬交替，古人认为「秋冬养阴」，应多补充营养能量以度过冬日严寒，因此各地均有「煲羊肉」、「迎霜兔肉」等说法。")))

(define 立冬
  (节气 '立冬 "立冬，是二十四节气中的第十九个节气，即太阳到达黄经225°之时，在公历每年11月6日至8日之间，象征着冬季的开始。立冬前后，中国大部分地区降水显著减少，空气渐趋干燥，动物准备冬眠，农林作物进入越冬期。 立，建始也； 冬，终也，万物收藏也。" 19
        "降水减少、气温下降"
        "水饺、羊肉汤"
        "秋收冬种"
        "银杏、秋菊"
        (hash "迎冬"
              "古人以冬与五方之北、五色之黑相配，据《后汉书》记载，天子曾率百官在北郊祭祀黑帝，迎接冬日的到来。《吕氏春秋·盂秋纪》中亦写道：「立冬之日，天子亲率三公九卿大夫以迎冬于北郊。」"
              "贺冬"
              "汉代既有「贺冬拜师」的习俗，东汉崔定《四民月令》：「冬至之日进酒肴，贺谒君师耆老，一如正日。」顾禄《清嘉录》中也有类似说法，「至日为冬至朝，士大夫家拜贺尊长，又交相出谒。细民男女，亦必更鲜衣以相揖，谓之拜冬。」")))

(define 小雪
  (节气 '小雪 "小雪，是二十四节气中的第二十个节气，即太阳到达黄经240°之时，在公历每年11月21日至23日之间，标志着降雪天气的开始。「小雪」是反映天气现象的节令，由于天气寒冷，华北地区的降水形式由雨变为雪，又因「地寒未甚」而降雪量较小。 雨下而为寒气所薄，故凝而为雪。小者，未盛之辞。" 20
        "气温下降、降雪结霜"
        "糍粑、红薯、南瓜、橘子"
        "注意防寒"
        "红枫、地锦"
        (hash "腌菜"
              "小雪节气前后容易出现霜降天气，经过霜打的菜叶变得柔软，适宜腌制咸菜，可以备在冬天新鲜蔬菜减少时食用。霜冻过后，蔬菜中的淀粉还能被转化为葡萄糖，促使甜度增加。"
              "吃糍粑"
              "糍粑由糯米蒸熟捣烂后制成，最早是农民用来祭牛神的供品，广泛流行于中国南方地区。《惠州志》书中所写的「十月朝，城中作粉食荐祖，乡落以粉食挂牛角以报其劳」，即指农历十月初一，农村的家家户户做糍粑，慰劳耕牛的辛苦劳作。")))

(define 大雪
  (节气 '大雪 "大雪，是二十四节气中的第二十一个节气，即太阳到达黄经255°之时，在公历每年12月6日至8日之间，象征着进入仲冬时节。中国北方地区受冷空气影响，常出现较大的降雪，引起地面积雪。与「小雪」相比，「大雪」的降雪量更大且范围更广。" 21
        "降雪量增大"
        "红薯粥、红枣糕，橘子、草莓"
        "培育壮苗，保暖"
        "腊梅、山茶"
        (hash "腌腊肉"
              "民间有俗语说「小雪腌菜，大雪腌肉」，冬季气温下降，空气愈加干燥，适宜腌制腊肠、腊肉、咸鱼等。人们将盐均匀地抹在肉上，放入陶制容器，依次完成腌制、晾晒等工序，延长肉类的存放时间。"
              "捕乌鱼"
              "大雪时节是台湾地区捕捞乌鱼的适宜时节，因天气渐冷，乌鱼沿水温线向南回流，整个台湾西部沿海都可以捕获乌鱼。《台湾府志》称：「乌鱼，即《本草》之鲻鱼；海港所产甚盛。冬至前捕之，曰正头乌，则肥而味美。」")))

(define 冬至
  (节气 '冬至 "大雪后十五日，为冬至，阴极而阳始至。 冬至，是二十四节气中的第二十二个节气，即太阳到达黄经270°之时，在公历每年12月21日至23日之间，标志着北半球的白昼时间达到全年最短，黑夜时间达到全年最长。冬至是最早被确定的一个节气，冬至之后，北半球白昼逐渐增长，正午太阳高度也日渐升高。" 22
        "寒潮暴雪，气温降低"
        "吃饺子、汤团、红豆饭，栗子、草莓、柚子"
        "中耕除草、培土壅根"
        "水仙、玉兰"
        (hash "团聚祭祖"
              "冬至是昔时各家庭团聚庆贺的节日，不仅家庭成员间相互饮「节酒」和食佳节美食庆祝，更会走访亲友居所庆贺送礼和祭奠祖先与神明。古时人们也会准备一套新衣服以求在冬至体面应节。"
              "冬至饺子"
              "民俗认为，冬天寒冷故应吃有营养的食品补充热量。因而冬至日有食饺子和馄饨的习俗：吃馄饨寓意破阴释阳，表达冬至的新旧交接宇宙混沌状态，更意味亲自开辟世界；而吃饺子又俗称「安耳朵」（挤饺形似耳朵），象征冬至日吃饺子是为了避免冻掉耳朵。"
              "赠鞋"
              "冬至节，古代民间习惯赠鞋。《中华古今注》记载：「汉有绣鸳鸯履，昭帝令冬至日上舅姑。」曹植《冬至献袜履表》中也有「国家冬至，献履贡袜，所以迎福践长」的说法，「迎福践长」即祈求祓厄迎福、寿命长久。"
              "数九"
              "梁代宗懔《荆楚岁时记》中写道：「俗用冬至日数及九九八十一日，为寒尽。」民间各地流传着多种版本的九九歌，「数九」从冬至日开始，每九天算一「九」，一直数到「九九」八十一天，即为「出九」，代表春暖花开的日子即将到来。")))

(define 小寒
  (节气 '小寒 "小寒是二十四节气中的第二十三个节气，即太阳到达黄经285°之时，在公历每年1月3日至1月5日之间。小寒标志着开始进入一年中最寒冷的日子，最寒冷的「三九天」多处于小寒节气。" 23
        "寒潮，显著降温"
        "蒜苗、韭黄、牛肉、羊肉"
        "防寒防冻，追施冬肥"
        "腊梅、山茶、水仙"
        (hash "吃菜饭" "南京有小寒吃菜饭的习俗。人们会将糯米与生姜、矮脚黄、咸肉、香肠等做成菜饭食用，以抵御寒冷天气，达到健脾暖胃、温肺散寒的功效。")))

(define 大寒
  (节气 '大寒 "大寒，是二十四节气中的最后一个节气，太阳到达黄经300°，在公历每年1月19日至21日之间。大寒意味着农历一年即将结束，人们开始辞旧迎新，迎接新的一年。 大寒，意谓酷寒，极冷，是一年中的寒冷时期，温低，风大，地表积雪不化，呈现出冰天雪地、地冻天寒的严寒景象。" 24
        "雨雪天气，大风降温"
        "胡萝卜、山楂、小米、羊肉"
        "防寒防冻"
        "瑞香、兰花、山矾"
        (hash
         "腊八节" "农历十二月初八为中国传统节日腊八节，古人有祭祀祖先神灵、祈求丰收的传统，中国佛教将其定为释迦牟尼成道之日。中国在腊八节有喝腊八粥的习俗，除此以外还有泡腊八蒜、制腊八醋、晒腊八豆腐等。"
         "腊八粥" "「腊八粥」又名「佛粥」，是腊八节的传统食品。富察敦崇《燕京岁时记·腊八粥》记载：「腊八粥者，用黄米、白米、江米、小米、菱角米、栗子、红豆、去皮枣泥等，合水煮熟，外用染红桃仁、杏仁、瓜子、花生、榛穰、松子及白糖、红糖、琐琐葡萄，以作点染。」"
         "尾牙祭" "农历十二月十六为尾牙祭，是中国闽南地区在大寒节气的传统习俗，源自当地人的做「牙」习俗。人们以农历二月初二开始，每逢初二和十六祭拜一次土地神，祈求生意兴隆、财运亨通，称为做「牙」。农历十二月十六为一年中最后一次做「牙」，意为「尾牙」，人们将在这一天赴庙祭拜神明，保佑来年风调雨顺。商人要在当天设「尾牙宴」招待员工，庆祝辞旧迎新。")))


(define 二十四节气
  (list 立春 雨水 惊蛰 春分 清明 谷雨 立夏 小满 芒种 夏至 小暑 大暑 立秋 处暑 白露 秋分 寒露 霜降 立冬 小雪 大雪 冬至 小寒 大寒))